БухЭксп/InformationRegisters/CW_ХарактеристикиГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантПредставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыПредставленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаАктаОказанияУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГруппУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура УдалитьЗаписьРегистра(КлючЗаписи) Экспорт
	
	Запись = РегистрыСведений.CW_ХарактеристикиГруппУслуг.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьДатыОказанияГруппУслуг(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ЗначенияКопирования.СрокОплаты КАК СрокОплаты,
	               |	ЗначенияКопирования.ДатаАктаОказанияУслуг КАК ДатаАктаОказанияУслуг,
	               |	ЗначенияКопирования.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы,
	               |	ЗначенияКопирования.ПодробноеОписание КАК ПодробноеОписание,
	               |	ЗначенияКопирования.ВариантПредставления КАК ВариантПредставления,
	               |	ЗначенияКопирования.Доход КАК Доход,
	               |	ЗначенияКопирования.СтавкаНДС КАК СтавкаНДС,
	               |	ВЫБОР
	               |		КОГДА ЗначенияОбъекта.ГруппаУслуг ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Копировать
	               |ПОМЕСТИТЬ ВТ_ЗначенияКопирования
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГруппУслуг КАК ЗначенияКопирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГруппУслуг КАК ЗначенияОбъекта
	               |		ПО ЗначенияКопирования.ГруппаУслуг = ЗначенияОбъекта.ГруппаУслуг
	               |			И (ЗначенияКопирования.Владелец = &ЗначениеКопирования)
	               |			И (ЗначенияОбъекта.Владелец = &Владелец)
	               |ГДЕ
	               |	ЗначенияКопирования.Владелец = &ЗначениеКопирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Владелец КАК Владелец,
	               |	ВТ_ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ВТ_ЗначенияКопирования.СрокОплаты КАК СрокОплаты,
	               |	ВТ_ЗначенияКопирования.ДатаАктаОказанияУслуг КАК ДатаАктаОказанияУслуг,
	               |	ВТ_ЗначенияКопирования.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы,
	               |	ВТ_ЗначенияКопирования.ПодробноеОписание КАК Описание,
	               |	ВТ_ЗначенияКопирования.ВариантПредставления КАК ВариантПредставления,
	               |	ВТ_ЗначенияКопирования.Доход КАК Доход,
	               |	ВТ_ЗначенияКопирования.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ЗначенияКопирования.Копировать КАК Копировать
	               |ИЗ
	               |	ВТ_ЗначенияКопирования КАК ВТ_ЗначенияКопирования
	               |ГДЕ
	               |	ВТ_ЗначенияКопирования.Копировать = ИСТИНА";

	Запрос.УстановитьПараметр("ЗначениеКопирования", 	ПараметрыПроцедуры.ЗначениеКопирования);
	Запрос.УстановитьПараметр("Владелец", 				ПараметрыПроцедуры.ТекущийОбъект);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборРегистра = РегистрыСведений.CW_ХарактеристикиГруппУслуг.СоздатьНаборЗаписей();
	НаборРегистра.Отбор.Владелец.Установить(ПараметрыПроцедуры.ТекущийОбъект);
	НаборРегистра.Прочитать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаНабора = НаборРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
	КонецЦикла;
	
	НаборРегистра.Записать();
	
	РегистрыСведений.CW_СоставГруппУслуг.СкопироватьСоставГруппУслуг(ПараметрыПроцедуры.ЗначениеКопирования, ПараметрыПроцедуры.ТекущийОбъект);
	
	ПоместитьВоВременноеХранилище(Неопределено ,АдресРезультата); 

КонецПроцедуры

#КонецЕсли
